# Основные клавиши:
# 1) Добавить или убрать комментарий - CTRL + /
# 2) Для отмены введенного текста(кода) нажимаем CTRL + Z
# 3) CTRL + SHIFT + F10 - запуск скрипта
# 4) Для вывода окна с подсказками используйте клавиши CTRL + Пробел
# from datetime import datetime

# Комментарий - это блок кода или текста, который игнорирует интепретатор

# В Python есть огромное количество команд. Команды называются функциями. Функция
# print используется для вывода информации в консоль


# print("Привет!\nКак дела?")

# print("""
# Первая строка
#     Вторая строка
# Третья строка""")

# names = ["Иван","Олег"]

# name = "Иван"
# current_date = datetime.today()
# 1ый способ вывода переменной совместно с текстом
# print("Привет, " + name + "!")

# 2-й способ вывода переменной совместно с текстом
# print("Привет, ",name,"!",sep="") #sep переопределяет значение запятой, которая по умолчанию = пробелу

# 3-ий способ
# print(f"Привет, {name}!")

# Пример с параметром end

# print(f"{name}, привет!",end=" ")
# print("Как дела?")

# print(f"Сегодня {current_date}")
