"""Дано расстояние в метрах. Найти число полных километров в нем."""

distance = int(input("Введите расстояние в метрах:\n"))
print(f"Вы указали {distance//1000} км")